# Chapter 7. Data Cleaning and Preparation
<a id='index'></a>
## Table of Content
- [7.1 Handling Missing Data](#71)
    - [7.1.1 Filtering Out Missing Data](#711)
    - [7.1.2 Filling in Missing Data](#712)
- [7.2 Data Transformation](#72)
    - [7.2.1 Removing Duplicates](#721)
    - [7.2.2 Transforming Data Using a Function or Mapping](#722)
    - [7.2.3 Replacing Values](#723)
    - [7.2.4 Renaming Axis Indexes](#724)
    - [7.2.5 Discretization and Binning](#725)
    - [7.2.6 Detecting and Filtering Outliers](#726)
    - [7.2.7 Permutation and Random Sampling](#727)
    - [7.2.8 Computing Indicator/Dummy Variables](#728)
- [7.3 String Manipulation](#73)
    - [7.3.1 String Object Methods](#731)

<hr>

## 7.1 Handling Missing Data
<a id='71'></a>

In [1]:
import numpy as np
import pandas as pd

In [2]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

### 7.1.1 Filtering Out Missing Data
<a id='711'></a>

In [3]:
data = pd.Series([1, np.NaN, 3.5, np.NaN, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [4]:
# This is equivalent to 
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [5]:
data = pd.DataFrame([[1., 6.5, 3.], [1., np.NaN, np.NaN],
                     [np.NaN, np.NaN, np.NaN], [np.NaN, 6.5, 3.]])
cleaned = data.dropna()

In [6]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [7]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [8]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [9]:
data['4'] = np.NaN
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [10]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [11]:
df = pd.DataFrame(np.random.randn(7, 3))
df.iloc[:4, 1] = np.NaN
df.iloc[:2, 2] = np.NaN
df

          0         1         2
0 -0.439551       NaN       NaN
1  0.710431       NaN       NaN
2  0.017136       NaN -1.236350
3 -0.795126       NaN -0.724600
4 -1.436126  2.511353  0.362069
5  0.595884  1.012765 -2.152729
6 -1.288569 -0.383434 -1.333299

In [12]:
df.dropna()

          0         1         2
4 -1.436126  2.511353  0.362069
5  0.595884  1.012765 -2.152729
6 -1.288569 -0.383434 -1.333299

In [13]:
df.dropna(thresh=2)

          0         1         2
2  0.017136       NaN -1.236350
3 -0.795126       NaN -0.724600
4 -1.436126  2.511353  0.362069
5  0.595884  1.012765 -2.152729
6 -1.288569 -0.383434 -1.333299

### 7.1.2 Filling In Missing Data
<a id='712'></a>

In [14]:
df.fillna(0)

          0         1         2
0 -0.439551  0.000000  0.000000
1  0.710431  0.000000  0.000000
2  0.017136  0.000000 -1.236350
3 -0.795126  0.000000 -0.724600
4 -1.436126  2.511353  0.362069
5  0.595884  1.012765 -2.152729
6 -1.288569 -0.383434 -1.333299

In [15]:
# Calling fillna with a dict, you can use a different fill value for each column:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0 -0.439551  0.500000  0.000000
1  0.710431  0.500000  0.000000
2  0.017136  0.500000 -1.236350
3 -0.795126  0.500000 -0.724600
4 -1.436126  2.511353  0.362069
5  0.595884  1.012765 -2.152729
6 -1.288569 -0.383434 -1.333299

In [16]:
# fillna returns a new object, but you can modify the existing object in-place
_ = df.fillna(0, inplace=True)
df

          0         1         2
0 -0.439551  0.000000  0.000000
1  0.710431  0.000000  0.000000
2  0.017136  0.000000 -1.236350
3 -0.795126  0.000000 -0.724600
4 -1.436126  2.511353  0.362069
5  0.595884  1.012765 -2.152729
6 -1.288569 -0.383434 -1.333299

In [17]:
df = pd.DataFrame(np.random.randn(6, 3))
df.iloc[2:, 1] = np.NaN
df.iloc[4:, 2] = np.NaN

In [18]:
df.fillna(method='ffill')

          0         1         2
0  0.554728  1.463818 -0.155030
1  0.487941 -0.998630 -1.282734
2  0.920000 -0.998630 -0.166779
3  0.106109 -0.998630 -0.547601
4  0.436137 -0.998630 -0.547601
5 -0.502392 -0.998630 -0.547601

In [19]:
df.fillna(method='ffill', limit=2)

          0         1         2
0  0.554728  1.463818 -0.155030
1  0.487941 -0.998630 -1.282734
2  0.920000 -0.998630 -0.166779
3  0.106109 -0.998630 -0.547601
4  0.436137       NaN -0.547601
5 -0.502392       NaN -0.547601

<hr>

## 7.2 Data Transformation
<a id='72'></a>

### 7.2.1 Removing Duplicates
<a id='721'></a>

In [20]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                     'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [21]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [22]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [23]:
data['v1'] = range(7)
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [24]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

### 7.2.2 Transforming Data Using a Function or Mapping
<a id='722'></a>

In [25]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon', 
                              'Pastrami', 'corned beef', 'Bacon',
                              'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [26]:
# Suppose you wanted to add a column indicating the type of animal that each food came from.
meat_to_animal = {
      'bacon': 'pig',
      'pulled pork': 'pig',
      'pastrami': 'cow',
      'corned beef': 'cow',
      'honey ham': 'pig',
      'nova lox': 'salmon'
}

lowercased = data['food'].str.lower()
data['animal'] = lowercased.map(meat_to_animal)

data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [27]:
# We could also have passed a function that does all the work: 
data['animal2'] = data['food'].map(lambda x: meat_to_animal[x.lower()])
data

          food  ounces  animal animal2
0        bacon     4.0     pig     pig
1  pulled pork     3.0     pig     pig
2        bacon    12.0     pig     pig
3     Pastrami     6.0     cow     cow
4  corned beef     7.5     cow     cow
5        Bacon     8.0     pig     pig
6     pastrami     3.0     cow     cow
7    honey ham     5.0     pig     pig
8     nova lox     6.0  salmon  salmon

### 7.2.3 Replacing Values
<a id='723'></a>

In [28]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [29]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [30]:
data.replace([-999, -1000], [np.nan, 0])
# data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

### 7.2.4 Renaming Axis Indexes
<a id='724'></a>

In [31]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [32]:
transform = lambda x: x[:4].upper()
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [33]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [34]:
data.rename(index={'OHIO': 'INDIANA'},
            columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [35]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

### 7.2.5 Discretization and Binning
<a id='725'></a>
Continuous data is often discretized or otherwise separated into “bins” for analysis.

In [36]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
bins = [18, 25, 35, 60, 100]

# Let’s divide these into bins of 18 to 25, 26 to 35, 36 to 60, and finally 61 and older. To
# do so, you have to use cut, a function in pandas
cats = pd.cut(ages, bins)

cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

The object pandas returns is a special Categorical object. The output you see describes the bins computed by pandas.cut. You can treat it like an array of strings indicating the bin name; internally it contains a categories array specifying the dis‐ tinct category names along with a labeling for the ages data in the codes attribute:

In [37]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [38]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]]
              closed='right',
              dtype='interval[int64]')

In [39]:
pd.value_counts(cats)

# a parenthesis means that the side is open, 
# while the square bracket means it is closed (inclusive).

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [40]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [41]:
# You can also pass your own bin names by passing a list or array to the labels option:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
pd.cut(ages, bins, labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

If you pass an integer number of bins to cut instead of explicit bin edges, it will com‐ pute equal-length bins based on the minimum and maximum values in the data.

In [42]:
data = np.random.rand(20)
pd.cut(data, 4, precision=2)

[(0.59, 0.77], (0.4, 0.59], (0.4, 0.59], (0.59, 0.77], (0.21, 0.4], ..., (0.4, 0.59], (0.59, 0.77], (0.02, 0.21], (0.21, 0.4], (0.59, 0.77]]
Length: 20
Categories (4, interval[float64]): [(0.02, 0.21] < (0.21, 0.4] < (0.4, 0.59] < (0.59, 0.77]]

In [43]:
pd.cut(data, 4, precision=2).categories

IntervalIndex([(0.02, 0.21], (0.21, 0.4], (0.4, 0.59], (0.59, 0.77]]
              closed='right',
              dtype='interval[float64]')

In [44]:
pd.value_counts(pd.cut(data, 4, precision=2))

(0.4, 0.59]     6
(0.02, 0.21]    6
(0.59, 0.77]    5
(0.21, 0.4]     3
dtype: int64

In [45]:
# qcut, bins the data based on sample quantiles. Depending on the distribution of the data
pd.qcut(data, 4) # Cut into quartiles

[(0.606, 0.775], (0.178, 0.485], (0.485, 0.606], (0.606, 0.775], (0.178, 0.485], ..., (0.485, 0.606], (0.606, 0.775], (0.0195, 0.178], (0.178, 0.485], (0.606, 0.775]]
Length: 20
Categories (4, interval[float64]): [(0.0195, 0.178] < (0.178, 0.485] < (0.485, 0.606] < (0.606, 0.775]]

In [46]:
pd.value_counts(pd.qcut(data, 4))

(0.606, 0.775]     5
(0.485, 0.606]     5
(0.178, 0.485]     5
(0.0195, 0.178]    5
dtype: int64

### 7.2.6 Detecting and Filtering Outliers
<a id='726'></a>

In [47]:
data = pd.DataFrame(np.random.randn(1000, 4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.016672    -0.065730     0.021750    -0.024522
std       0.991191     0.986458     0.998628     1.032415
min      -2.884295    -2.696949    -3.060589    -3.230913
25%      -0.688960    -0.774192    -0.664081    -0.710727
50%      -0.014033    -0.060032     0.018435    -0.030802
75%       0.669453     0.602627     0.674222     0.662727
max       2.909634     3.020199     3.121797     3.607708

In [48]:
col = data[2]
col[np.abs(col) > 2.5]

36    -2.838851
68     2.926919
97     2.575768
117    2.511297
179    2.777395
315    2.724879
382   -3.060589
421    2.604844
441   -2.752587
460    2.613601
493    3.100671
526    2.722411
810    3.121797
853    2.512326
949   -2.611381
Name: 2, dtype: float64

In [49]:
# pd.DataFrame.any?
data[(np.abs(data) > 1).all(1)]

            0         1         2         3
25  -2.238205 -1.614706  1.559596 -1.503736
86   1.328607 -1.063865  1.554350  1.289747
92  -2.370728 -1.812907  2.310509  1.215178
294 -1.608476 -1.661619 -1.052079 -1.099802
403  1.617666  1.848239 -1.034779  1.453459
420  1.675304 -1.784135  1.018310  1.035364
452  1.793789 -1.145068 -2.020075 -1.392021
572 -1.198459 -1.943948 -1.715673 -1.788155
778 -2.184161  1.386689  1.004917 -1.761224
837 -1.632734  2.283488  1.729198  1.499354

In [50]:
# Values can be set based on these criteria. Here is code to cap values outside the inter‐ val –3 to 3:
data[np.abs(data) > 3] = np.sign(data) * 3
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.016672    -0.065750     0.021588    -0.025135
std       0.991191     0.986395     0.997766     1.029037
min      -2.884295    -2.696949    -3.000000    -3.000000
25%      -0.688960    -0.774192    -0.664081    -0.710727
50%      -0.014033    -0.060032     0.018435    -0.030802
75%       0.669453     0.602627     0.674222     0.662727
max       2.909634     3.000000     3.000000     3.000000

In [51]:
# The statement np.sign(data) produces 1 and –1 values based on whether the values in data are positive or negative:
np.sign(data).head()

     0    1    2    3
0 -1.0  1.0 -1.0 -1.0
1 -1.0 -1.0  1.0 -1.0
2 -1.0 -1.0 -1.0 -1.0
3  1.0  1.0 -1.0 -1.0
4  1.0  1.0 -1.0  1.0

### 7.2.7 Permutation and Random Sampling
<a id='727'></a>
Calling permutation with the length of the axis you want to permute produces an array of integers indicating the new ordering:

In [52]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))

In [53]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [54]:
sampler = np.random.permutation(5)
sampler

array([0, 1, 4, 2, 3])

In [55]:
# That array can then be used in iloc-based indexing or the equivalent take function:
df.take(sampler)

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
4  16  17  18  19
2   8   9  10  11
3  12  13  14  15

In [56]:
# To select a random subset without replacement, you can use the sample method on Series and DataFrame:
df.sample(n=3)

    0   1   2   3
0   0   1   2   3
2   8   9  10  11
3  12  13  14  15

In [57]:
# To generate a sample with replacement (to allow repeat choices), pass replace=True to sample:
choices = pd.Series([5, 7, -1, 6, 4])
draws = choices.sample(n=10, replace=True)
draws

2   -1
4    4
4    4
4    4
2   -1
2   -1
1    7
2   -1
4    4
3    6
dtype: int64

### 7.2.8 Computing Indicator/Dummy Variables
<a id='728'></a>
Another type of transformation for statistical modeling or machine learning applica‐ tions is converting a categorical variable into a “dummy” or “indicator” matrix. If a column in a DataFrame has k distinct values, you would derive a matrix or Data‐ Frame with k columns containing all 1s and 0s by using pd.get_dummies(df['key'])

In [58]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'], 'data1': range(6)})
df

   data1 key
0      0   b
1      1   b
2      2   a
3      3   c
4      4   a
5      5   b

In [59]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [60]:
# You may want to add a prefix to the columns in the indicator DataFrame, 
# which can then be merged with the other data. get_dummies has a prefix argu‐ ment for doing this:
dummies = pd.get_dummies(df['key'], prefix='key')
df_with_dummies = df[['data1']].join(dummies)
df_with_dummies

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [66]:
# Let’s look at the MovieLens 1M dataset
mnames = ['movie_id', 'title', 'genres']
movies = pd.read_csv('examples/movies.csv')
movies.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [78]:
all_genres = []
for x in movies['genres']:
    all_genres.extend(x.split('|'))
    
genres = pd.unique(all_genres)
genres

array(['Adventure', 'Animation', 'Children', 'Comedy', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Mystery', 'Sci-Fi', 'Documentary', 'IMAX', 'War', 'Musical',
       'Western', 'Film-Noir', '(no genres listed)'], dtype=object)

In [91]:
# One way to construct the indicator DataFrame is to start with a DataFrame of all zeros:
zero_matrix = np.zeros((len(movies), len(genres)))
dummies = pd.DataFrame(zero_matrix, columns = genres)

# Now, iterate through each movie and set entries in each row of dummies to 1. 
# To do this, we use the dummies.columns to compute the column indices for each genre:
gen = movies.genres[2]
gen.split('|')    
# ['Adventure', 'Animation', 'Children', 'Comedy', 'Fantasy']

dummies.columns.get_indexer(gen.split('|'))    
# array([0, 1, 2, 3, 4])

# Then, we can use .iloc to set values based on these indices:
for i, gen in enumerate(movies.genres):
    indices = dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i, indices] = 1
    
movies_windic = movies.join(dummies.add_prefix('Genre_'))

movies_windic.iloc[2]

movieId                                           3
title                       Grumpier Old Men (1995)
genres                               Comedy|Romance
Genre_Adventure                                   0
Genre_Animation                                   0
Genre_Children                                    0
Genre_Comedy                                      1
Genre_Fantasy                                     0
Genre_Romance                                     1
Genre_Drama                                       0
Genre_Action                                      0
Genre_Crime                                       0
Genre_Thriller                                    0
Genre_Horror                                      0
Genre_Mystery                                     0
Genre_Sci-Fi                                      0
Genre_Documentary                                 0
Genre_IMAX                                        0
Genre_War                                         0
Genre_Musical                                     0
Genre_Western                                     0
Genre_Film-Noir                                   0
Genre_(no genres listed)                          0
Name: 2, dtype: object

In [95]:
# A useful recipe for statistical applications is to combine get_dummies with a discretization function like cut:
np.random.seed(12345)

values = np.random.rand(10)

bins = [0, 0.2, 0.4, 0.6, 0.8, 1.]
#pd.cut(values, bins)
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

<hr>

## 7.3 String Manipulation
<a id='73'></a>
### 7.3.1 String Object Methods
<a id='731'></a>

In [96]:
val = 'a,b, guido'

val.split(',')

['a', 'b', ' guido']

<hr>

[Back to top](#index)